In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('data.csv')
## fetch the first 5 rows
df.head(5)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [7]:
df.tail(5)

     Order ID  Amount  Profit  Quantity     Category Sub-Category PaymentMode
1495  B-25700       7      -3         2     Clothing  Hankerchief         COD
1496  B-25757    3151     -35         7     Clothing     Trousers         EMI
1497  B-25973    4141    1698        13  Electronics     Printers         COD
1498  B-25698       7      -2         1     Clothing  Hankerchief         COD
1499  B-25993    4363     305         5    Furniture       Tables         EMI

In [5]:
df.describe()

            Amount      Profit     Quantity
count  1500.000000  1500.00000  1500.000000
mean    291.847333    24.64200     3.743333
std     461.924620   168.55881     2.184942
min       4.000000 -1981.00000     1.000000
25%      47.750000   -12.00000     2.000000
50%     122.000000     8.00000     3.000000
75%     326.250000    38.00000     5.000000
max    5729.000000  1864.00000    14.000000

In [8]:
df.dtypes

Order ID          str
Amount          int64
Profit          int64
Quantity        int64
Category          str
Sub-Category      str
PaymentMode       str
dtype: object

In [9]:
## handling missing values
df.isnull()

      Order ID  Amount  Profit  Quantity  Category  Sub-Category  PaymentMode
0        False   False   False     False     False         False        False
1        False   False   False     False     False         False        False
2        False   False   False     False     False         False        False
3        False   False   False     False     False         False        False
4        False   False   False     False     False         False        False
...        ...     ...     ...       ...       ...           ...          ...
1495     False   False   False     False     False         False        False
1496     False   False   False     False     False         False        False
1497     False   False   False     False     False         False        False
1498     False   False   False     False     False         False        False
1499     False   False   False     False     False         False        False

[1500 rows x 7 columns]

In [10]:
df.fillna(0)

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card
...,...,...,...,...,...,...,...
1495,B-25700,7,-3,2,Clothing,Hankerchief,COD
1496,B-25757,3151,-35,7,Clothing,Trousers,EMI
1497,B-25973,4141,1698,13,Electronics,Printers,COD
1498,B-25698,7,-2,1,Clothing,Hankerchief,COD
1499,B-25993,4363,305,5,Furniture,Tables,EMI

In [13]:
## data aggregating and grouping
grouped_mean=df.groupby('Amount')['Profit'].mean()
print(grouped_mean)

Amount
4         -3.000000
6          0.333333
7         -1.444444
8         -1.833333
9         -3.800000
           ...
3151     -35.000000
3873    -891.000000
4141    1698.000000
4363     305.000000
5729      64.000000
Name: Profit, Length: 590, dtype: float64

In [ ]:
pd.read_excel('data.xlsx')